# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 0s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 0s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_stag: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_dev: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.grafana_k8s_monitoring will be updated in-place
  ~ resource "helm_release" "grafana_k8s_monitoring" {
      ~ id                         = "k8s-monitoring" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "3.2.2" -> (known after apply)
          ~ chart          = "k8s-monitoring" -> (known after apply)
          ~ first_deployed = 1753948983 -> (known after apply)
          ~ last_deployed  = 1754305218 -> (known after apply)
          ~ name           = "k8s-monitoring" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                Grafana k8s-monitoring Helm chart deployed!
                
                This chart will install the following components:
                * Grafana Alloy "alloy-logs" (daemonset)
                
                It will:
                * Gather Kubernetes Cluster events and send data to loki.
                * Gather logs from Kubernetes Pods and send data to loki.
                  
                  
                
                Thanks for trying out the alloy-operator!
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alloy-logs      = {
                      - alloy      = {
                          - clustering = {
                              - enabled = true
                            }
                          - mounts     = {
                              - dockercontainers = false
                              - varlog           = false
                            }
                        }
                      - controller = {
                          - podAnnotations = {
                              - "kubernetes.azure.com/set-kube-service-host-fqdn" = "true"
                            }
                        }
                      - enabled    = true
                    }
                  - alloy-metrics   = {
                      - enabled = false
                    }
                  - alloy-profiles  = {
                      - enabled = false
                    }
                  - alloy-receiver  = {
                      - enabled = false
                    }
                  - alloy-singleton = {
                      - enabled = false
                    }
                  - cluster         = {
                      - name = "k6tests-cluster"
                    }
                  - clusterEvents   = {
                      - collector = "alloy-logs"
                      - enabled   = true
                    }
                  - destinations    = [
                      - {
                          - auth   = {
                              - passwordKey = "password"
                              - type        = "basic"
                              - usernameKey = "username"
                            }
                          - name   = "loki"
                          - secret = {
                              - create    = false
                              - name      = "canary-basic-auth"
                              - namespace = "monitoring"
                            }
                          - type   = "loki"
                          - url    = "http://loki-loki-distributed-gateway.monitoring.svc.cluster.local/loki/api/v1/push"
                        },
                    ]
                  - nodeLogs        = {
                      - enabled = false
                    }
                  - podLogs         = {
                      - collector    = "alloy-logs"
                      - enabled      = true
                      - gatherMethod = "kubernetesApi"
                    }
                }
            ) -> (known after apply)
          ~ version        = "3.2.2" -> (known after apply)
        } -> (known after apply)
        name                       = "k8s-monitoring"
      ~ values                     = [
          ~ <<-EOT
                # https://github.com/grafana/k8s-monitoring-helm/blob/main/charts/k8s-monitoring/README.md
                ---
                cluster:
                  name: "k6tests-cluster"
                
                destinations:
                  - name: loki
                    type: loki
                    url: http://loki-loki-distributed-gateway.monitoring.svc.cluster.local/loki/api/v1/push
                    auth:
                      type: basic
                      usernameKey: username
                      passwordKey: password
                    secret:
                      create: false
                      name: canary-basic-auth
                      namespace: monitoring
                
                clusterEvents:
                  enabled: true
                  collector: alloy-logs
              -   # namespaces:
              +   namespaces: ["authentication","core","correspondence","dialogporten"]
                
                nodeLogs:
                  enabled: false
                
                podLogs:
                  enabled: true
                  gatherMethod: kubernetesApi
                  collector: alloy-logs
              -   # namespaces:
              +   namespaces: ["authentication","core","correspondence","dialogporten"]
                
                # Collectors
                alloy-singleton:
                  enabled: false
                
                alloy-metrics:
                  enabled: false
                
                alloy-logs:
                  enabled: true
                  # Required when using the Kubernetes API to pod logs
                  alloy:
                    mounts:
                      varlog: false
                      dockercontainers: false
                
                    clustering:
                      enabled: true
                
                  controller:
                    podAnnotations:
                      "kubernetes.azure.com/set-kube-service-host-fqdn": "true"
                
                alloy-profiles:
                  enabled: false
                
                alloy-receiver:
                  enabled: false
            EOT,
        ]
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`